tap "coursier/formulas"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "weaveworks/tap"
# Generic-purpose lossless compression algorithm by Google
brew "brotli"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Modern, maintained replacement for ls
brew "eza"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# GNU grep, egrep and fgrep
brew "grep"
# Improved top (interactive process viewer)
brew "htop"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Enhanced version of john, a UNIX password cracker
brew "john-jumbo"
# Run local Kubernetes cluster in Docker
brew "kind"
# Simple terminal UI for git commands
brew "lazygit"
# Linux virtual machines
brew "lima"
# Implementation of IEEE 802.1ab (LLDP)
brew "lldpd"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Python package management tool
brew "poetry"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# User interface to the TELNET protocol
brew "telnet"
# Powerful free data recovery utility
brew "testdisk"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# HTTP benchmarking tool
brew "wrk"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Launcher for Coursier
brew "coursier/formulas/coursier"
# The official CLI for Amazon EKS
brew "weaveworks/tap/eksctl"
# Web browser
cask "firefox"
cask "font-fira-code"
cask "font-meslo-lg-nerd-font"
# Browse, manage, inspect containers and images
cask "podman-desktop"
# Archive manager for data compression and backups
cask "rar"
